# Pandas

- its a python library used for working with datas
- it provides easy to use data structure 
- helps cleaning,manipulation and analysis 
- can easily import datasets from csv,excel,json and sql
- there are two primary data structures in pandas **Series** & **Dataframe**
- **Series** -> 1D labeled homogeneous array
- **DataFrame** -> 2d labeled heterogeneous table

In [2]:
import pandas as pd

# Series
- 1D single column data
- homogeneus -> usually stores one data type
- size immputable -> once created, the number of elements cannot change, but the values can be updated
- labled -> each elements has an index, default range index

In [3]:
s1 = pd.Series([10,20,30,40,50]) # used for creating single column data

s1.dtype

dtype('int64')

In [4]:
s1.values # used for checking values of the series

array([10, 20, 30, 40, 50])

In [5]:
s1.index #gives the index lables

RangeIndex(start=0, stop=5, step=1)

In [6]:
index = ['a','b','c','d','f']

s1.index = index # also can change the index lables

s1

a    10
b    20
c    30
d    40
f    50
dtype: int64

In [7]:
s1.keys() # gives the index numbers or custom lables

Index(['a', 'b', 'c', 'd', 'f'], dtype='object')

In [8]:
s1['a':'c'] # in lable baased indexing the start value as well as the stop value also includes in the output
# in normal indexing the stop value will exclude in the out put

a    10
b    20
c    30
dtype: int64

In [9]:
s1.iloc[0] # accesse by integer position only it ignore lables always looks at the numeric position

np.int64(10)

In [10]:
s1.loc['a'] # access by index lables work with default numbers or custom lables

np.int64(10)

In [11]:
# the default name will be None
s1.name = "numbers" # we can assign a new name using .name
print(s1.name)
print(s1)

numbers
a    10
b    20
c    30
d    40
f    50
Name: numbers, dtype: int64

In [12]:
# creating a Series out of a dictionary
dict1 = {
    "apple":27,
    "orange":21,
    "banana":30,
    "grape":25,
    "pineapple":20,
    "strawberry":32,
    "blueberry":45,
    "jackfruit":26,
    "lemon":12,
    "avocado":28
}

s2 = pd.Series(dict1, name="fruits") 
print(s2.name)
print(s2)

fruits
apple         27
orange        21
banana        30
grape         25
pineapple     20
strawberry    32
blueberry     45
jackfruit     26
lemon         12
avocado       28
Name: fruits, dtype: int64

In [13]:
s2.loc[['orange','apple','banana']]

orange    21
apple     27
banana    30
Name: fruits, dtype: int64

In [14]:
s2.iloc[1:4]

orange    21
banana    30
grape     25
Name: fruits, dtype: int64

In [15]:
s2.iloc[[9,8,7]]

avocado      28
lemon        12
jackfruit    26
Name: fruits, dtype: int64

In [16]:
print(s2.keys())
print(s2.values)

Index(['apple', 'orange', 'banana', 'grape', 'pineapple', 'strawberry',
       'blueberry', 'jackfruit', 'lemon', 'avocado'],
      dtype='object')
[27 21 30 25 20 32 45 26 12 28]

In [17]:
extract = s2[s2>=28] # filtering series values using a condition called conditional selection
extract

banana        30
strawberry    32
blueberry     45
avocado       28
Name: fruits, dtype: int64

In [18]:
[(s2>20) & (s2<30)] # we need both condition meets true to get the result true

[apple          True
 orange         True
 banana        False
 grape          True
 pineapple     False
 strawberry    False
 blueberry     False
 jackfruit      True
 lemon         False
 avocado        True
 Name: fruits, dtype: bool]

In [19]:
s2["grape"]=100 # this is how we can modify a series
s2

apple          27
orange         21
banana         30
grape         100
pineapple      20
strawberry     32
blueberry      45
jackfruit      26
lemon          12
avocado        28
Name: fruits, dtype: int64

# DataFrame
- 2D structure multiple rows and columns
- hetrogeneous -> each column can have multiple data types
- size mutable -> can remove or add rows and columns
- rows can have index numbers (can be customized) columns can have names/lables
- tabular structure -> data is organized as a table format

In [20]:
import numpy as np

data = {
    "name":["jishnu","anusree","vishnu","abi"],
    "age":[26,26,16,np.nan],
    "department":["HR","sales","student","intern"],
    "sallery":[50000,25000,np.nan,10000]
}

df = pd.DataFrame(data)
df.index = ['a','b','c','d']
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [21]:
df.head(2) # to quickly view first few rows (works both in data frame and series)

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0

In [22]:
df.tail(3) # to quickly view last few rows (works both in data frame and sseries)

      name   age department  sallery
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [23]:
df.loc['a':'c' ,["department","sallery"]] # [rows , labeled indexing]

  department  sallery
a         HR  50000.0
b      sales  25000.0
c    student      NaN

In [24]:
df.iloc[2:4,1:3] # [rows,columns] in numerical indexing

    age department
c  16.0    student
d   NaN     intern

In [25]:
df["department"]

a         HR
b      sales
c    student
d     intern
Name: department, dtype: object

In [26]:
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [27]:
df.drop('age',axis=1,inplace=False) # used to remove rows or columns using lable (lable,axis,inplase = False by default 
# when inplace make True manually it will remove the entire row or column permenently

      name department  sallery
a   jishnu         HR  50000.0
b  anusree      sales  25000.0
c   vishnu    student      NaN
d      abi     intern  10000.0

In [28]:
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [29]:
df.loc['c','sallery']

np.float64(nan)

In [30]:
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [4]:
import numpy as np

numbers  = np.arange(1,11)
s = pd.Series(numbers)

s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

- using columns.values[index number] and rename{columns = {column name : new name, inplace=True}
- mainly used for changing column names

In [39]:
s=np.arange(1,10).reshape(3,3)
b = pd.DataFrame(s)
b.index = ['a','b','c']

b.columns=['num1','num2','num3'] # used to change entire column names 
b.columns.values[0] = 'Name' # used to change a single column name
b.columns.values[2] = 'age'
b.rename(columns = {"num2":"adress"} , inplace = True) # used to change a single column name

b["sum"] = np.arange(1,4)
b["new"] = np.zeros(3)
c = b.iloc[1].tolist() # selecting single row using iloc
d = b["age"].tolist() 
f = b.iloc[:,3] # selecting single column using iloc
g = b.drop("sum",axis =1) # using drop to remove a column
h = b.drop('c',inplace = False)
print(b)
print()
print(f"single row {c}")
print()
print(f"single column {d}")
print()
print(f)
print(d)
print(g)
print(h)

   Name  adress  age  sum  new
a     1       2    3    1  0.0
b     4       5    6    2  0.0
c     7       8    9    3  0.0

single row [4.0, 5.0, 6.0, 2.0, 0.0]

single column [3, 6, 9]

a    1
b    2
c    3
Name: sum, dtype: int64
[3, 6, 9]
   Name  adress  age  new
a     1       2    3  0.0
b     4       5    6  0.0
c     7       8    9  0.0
   Name  adress  age  sum  new
a     1       2    3    1  0.0
b     4       5    6    2  0.0

In [ ]:
b.info() # used to check informations about a data frame

In [ ]:
b.describe() # used to check statistical informations of a data frame

In [40]:
arr = {
    "numbers" : [1,2,1,2,3,4,3,2,5,6,4,3,2,1]
}

df = pd.DataFrame(arr)
df["numbers"].unique() # to find unique values without duplicates
df["numbers"].nunique() # to find unique values count
df["numbers"].value_counts() # to find the frequency of each values

numbers
2    4
1    3
3    3
4    2
5    1
6    1
Name: count, dtype: int64

In [180]:
arr = {

    "name":["jishnu","vishnu"],
    "age":[26,np.nan]
}

df = pd.DataFrame(arr)
df.loc[2] = ['swetha',30] # also used for adding rows
df.loc[3] = ['abinav',25]
df.loc[4] = ['ajay',np.nan]
df["height"] = np.linspace(5,7,5) # used for adding new column
df["sallery"] = np.linspace(10000,30000,5,dtype = int)
df["promotted sallery"] = df['sallery'] *2

df

     name   age  height  sallery  promotted sallery
0  jishnu  26.0     5.0    10000              20000
1  vishnu   NaN     5.5    15000              30000
2  swetha  30.0     6.0    20000              40000
3  abinav  25.0     6.5    25000              50000
4    ajay   NaN     7.0    30000              60000

In [181]:
df.dropna(how = 'all')

     name   age  height  sallery  promotted sallery
0  jishnu  26.0     5.0    10000              20000
1  vishnu   NaN     5.5    15000              30000
2  swetha  30.0     6.0    20000              40000
3  abinav  25.0     6.5    25000              50000
4    ajay   NaN     7.0    30000              60000

In [182]:
df.fillna(25)

     name   age  height  sallery  promotted sallery
0  jishnu  26.0     5.0    10000              20000
1  vishnu  25.0     5.5    15000              30000
2  swetha  30.0     6.0    20000              40000
3  abinav  25.0     6.5    25000              50000
4    ajay  25.0     7.0    30000              60000

In [183]:
df[["name"]]

     name
0  jishnu
1  vishnu
2  swetha
3  abinav
4    ajay

In [184]:
df.iloc[:,[2]]

   height
0     5.0
1     5.5
2     6.0
3     6.5
4     7.0

In [185]:
df.loc[:,["age"]]

    age
0  26.0
1   NaN
2  30.0
3  25.0
4   NaN

In [186]:
df

     name   age  height  sallery  promotted sallery
0  jishnu  26.0     5.0    10000              20000
1  vishnu   NaN     5.5    15000              30000
2  swetha  30.0     6.0    20000              40000
3  abinav  25.0     6.5    25000              50000
4    ajay   NaN     7.0    30000              60000

In [187]:
df

     name   age  height  sallery  promotted sallery
0  jishnu  26.0     5.0    10000              20000
1  vishnu   NaN     5.5    15000              30000
2  swetha  30.0     6.0    20000              40000
3  abinav  25.0     6.5    25000              50000
4    ajay   NaN     7.0    30000              60000

In [188]:
df.loc['b','age'] = 15
df
df.iloc[4,1] = 25
df

     name   age  height  sallery  promotted sallery
0  jishnu  26.0     5.0  10000.0            20000.0
1  vishnu   NaN     5.5  15000.0            30000.0
2  swetha  30.0     6.0  20000.0            40000.0
3  abinav  25.0     6.5  25000.0            50000.0
4    ajay  25.0     7.0  30000.0            60000.0
b     NaN  15.0     NaN      NaN                NaN

In [189]:
df.keys()

Index(['name', 'age', 'height', 'sallery', 'promotted sallery'], dtype='object')

In [190]:
df['sallery'].describe()

count        5.00000
mean     20000.00000
std       7905.69415
min      10000.00000
25%      15000.00000
50%      20000.00000
75%      25000.00000
max      30000.00000
Name: sallery, dtype: float64

In [191]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to b
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               5 non-null      object
 1   age                5 non-null      float64
 2   height             5 non-null      float64
 3   sallery            5 non-null      float64
 4   promotted sallery  5 non-null      float64
dtypes: float64(4), object(1)
memory usage: 460.0+ bytes

In [192]:
df.loc['f'] = ['nasi',25,5.5,20000,0]
df

     name   age  height  sallery  promotted sallery
0  jishnu  26.0     5.0  10000.0            20000.0
1  vishnu   NaN     5.5  15000.0            30000.0
2  swetha  30.0     6.0  20000.0            40000.0
3  abinav  25.0     6.5  25000.0            50000.0
4    ajay  25.0     7.0  30000.0            60000.0
b     NaN  15.0     NaN      NaN                NaN
f    nasi  25.0     5.5  20000.0                0.0

In [193]:
df['sallery'] = df['sallery'] + 5000
df['promotted sallery'] = df['sallery'] * 2
df

     name   age  height  sallery  promotted sallery
0  jishnu  26.0     5.0  15000.0            30000.0
1  vishnu   NaN     5.5  20000.0            40000.0
2  swetha  30.0     6.0  25000.0            50000.0
3  abinav  25.0     6.5  30000.0            60000.0
4    ajay  25.0     7.0  35000.0            70000.0
b     NaN  15.0     NaN      NaN                NaN
f    nasi  25.0     5.5  25000.0            50000.0

- Basic practice with DataFrame

## adding removing merging renaming DataFrame

In [5]:
obj1 = { 
    'name':['ram','jhon','peter','bob'],
    'age':[25,24,20,22]
}

obj2 = {
    'name':['maria','alise','diana'],
    'age':[21,19,18]
}

df1 = pd.DataFrame(obj1)
df2 = pd.DataFrame(obj2)

df3 = pd.concat([df1,df2],ignore_index = True) # used for concatinating 2 data frames in to one
df3["department"] = ['hr','sales','inventory','IT','techsupport','intern','accounts'] # adding new column
df3["salary"] = np.linspace(10000,100000,7,dtype = int)
df3["promotted salary"] = df3['salary'] *2 # broadcasting 
df3.rename(columns = {"promotted salary":"PM Salary"}, inplace = True) # renaming a column
df3.loc[7] = ['jenny',23,'teamlead',70000,160000] # adding new row
dele = df3.drop(6,axis = 0, inplace = False) # deleting rows
re = df3.drop('department', axis = 1 , inplace = False) # deleting columns
top = df3.sort_values('salary' , ascending = False).head(1) # finding top sallery person
print(df3)
print()
print(dele)
print()
print(re)
print()
print(df3.head(3))
print()
print(df3.tail(2))
print()
print(df3['department'].value_counts())
print()
print(top)

    name  age   department  salary  PM Salary
0    ram   25           hr   10000      20000
1   jhon   24        sales   25000      50000
2  peter   20    inventory   40000      80000
3    bob   22           IT   55000     110000
4  maria   21  techsupport   70000     140000
5  alise   19       intern   85000     170000
6  diana   18     accounts  100000     200000
7  jenny   23     teamlead   70000     160000

    name  age   department  salary  PM Salary
0    ram   25           hr   10000      20000
1   jhon   24        sales   25000      50000
2  peter   20    inventory   40000      80000
3    bob   22           IT   55000     110000
4  maria   21  techsupport   70000     140000
5  alise   19       intern   85000     170000
7  jenny   23     teamlead   70000     160000

    name  age  salary  PM Salary
0    ram   25   10000      20000
1   jhon   24   25000      50000
2  peter   20   40000      80000
3    bob   22   55000     110000
4  maria   21   70000     140000
5  alise   19   85000     170000
6  diana   18  100000     200000
7  jenny   23   70000     160000

    name  age department  salary  PM Salary
0    ram   25         hr   10000      20000
1   jhon   24      sales   25000      50000
2  peter   20  inventory   40000      80000

    name  age department  salary  PM Salary
6  diana   18   accounts  100000     200000
7  jenny   23   teamlead   70000     160000

department
hr             1
sales          1
inventory      1
IT             1
techsupport    1
intern         1
accounts       1
teamlead       1
Name: count, dtype: int64

    name  age department  salary  PM Salary
6  diana   18   accounts  100000     200000

## Dealing with missing values
- ffill() & bfill()
- 2 types of filling null values forward filling and backward filling

In [23]:
list1 = [12,23,21,np.nan,12,32,np.nan]

s1 = pd.Series(list1)
s1.name = 'Numbers'
print(s1)
print()
f1 = s1.ffill() # forward fill used to fill values from the next known value from above
print(f1)
f2 = s1.bfill() # backward fill used to fill values from the next known values from below
print()
print(f2)
d = s1.drop([6,3],inplace = False)
d
s1.info()
f2.describe()

fil = s1.fillna(s1.median(),inplace = False) # another method of filling values
fil

0    12.0
1    23.0
2    21.0
3     NaN
4    12.0
5    32.0
6     NaN
Name: Numbers, dtype: float64

0    12.0
1    23.0
2    21.0
3    21.0
4    12.0
5    32.0
6    32.0
Name: Numbers, dtype: float64

0    12.0
1    23.0
2    21.0
3    12.0
4    12.0
5    32.0
6     NaN
Name: Numbers, dtype: float64
<class 'pandas.core.series.Series'>
RangeIndex: 7 entries, 0 to 6
Series name: Numbers
Non-Null Count  Dtype
--------------  -----
5 non-null      float64
dtypes: float64(1)
memory usage: 188.0 bytes

0    12.0
1    23.0
2    21.0
3    21.0
4    12.0
5    32.0
6    21.0
Name: Numbers, dtype: float64